docs/radixsort.html
<!doctype html>
<html lang="en">
<head>
<title>Algoritmo Radix Sort</title>
<!-- 2022-05-23 Mon 16:58 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Pietro Visconti">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Specifiche preliminari</a></li>
<li><a href="#sec-2">2. Algoritmo</a></li>
<li><a href="#sec-3">3. Complessità</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Algoritmo Radix Sort</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Specifiche preliminari</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Questo algoritmo viene utilizzato per ordinare elementi con &ldquo;d&rdquo; cifre dove la cifra 1 è quella meno significativa, &ldquo;d&rdquo; quella più significativa.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Algoritmo</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #928374;">/*</span>
<span style="color: #928374;">A = array da ordinare</span>
<span style="color: #928374;">d = numero di cifre dei numeri da ordinare</span>
<span style="color: #928374;">*/</span>
<span style="color: #b8bb26;">RADIX_SORT</span><span style="color: #fe8019;">(</span><span style="color: #fabd2f;">Array</span> <span style="color: #83a598;">A</span>, <span style="color: #fabd2f;">int</span> <span style="color: #83a598;">d</span><span style="color: #fe8019;">){</span>
    <span style="color: #fb4934;">for</span><span style="color: #cc241d;">(</span><span style="color: #fabd2f;">int</span> <span style="color: #83a598;">i</span> = <span style="color: #d3869b; font-weight: bold;">1</span>; i &lt;= d; i++<span style="color: #cc241d;">){</span>
        A = counting_sort<span style="color: #b8bb26;">(</span>A, <span style="color: #d3869b; font-weight: bold;">9</span>, d<span style="color: #b8bb26;">)</span>;
    <span style="color: #cc241d;">}</span>
<span style="color: #fe8019;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Complessità</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
Dati n numeri, ciascuno di n cifre, dove ogni cifra può avere fino a k valori possibili, la procedura radix-sort ordina correttamente i numeri nel tempo di esecuzione <font color="red"> θ(d * (n + k))</font>
se l&rsquo;ordinamento stabile della procedura impiega tempo <font color="red"> θ(n + k)</font>
</p>
</blockquote>

<p>
<a href="../index.html">HOME</a>
</p>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Pietro Visconti</p>
<p class="date">Created: 2022-05-23 Mon 16:58</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
